<html><!-- #BeginTemplate "/Templates/Articoli2.dwt" -->
<head>
<script language="JavaScript" src="../funzioni.js"></script>
<script language="JavaScript" src="../scroller.js"></script>
<!-- #BeginEditable "doctitle" --> 
<title>Open Source: i difetti diventano pregi</title>
<!-- #EndEditable --> 
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="../stili.css" rel="stylesheet" type="text/css" title="stili">
<link href="../codicevb.css" rel="stylesheet" type="text/css" title="codicevb">
<link href="../colori.css" rel="stylesheet" type="text/css" title="colori">
<meta name="description" content="Visual Basic Simple &egrave; l'unico sito in Italia che tratta la programmazione in Visual Basic in un'ottica mai vista prima d'ora. Tutti gli articoli sono spiegati passo dopo passo ed in una maniera davvero semplice per consentire a tutti di comprendere gli argomenti trattati.">
<meta name="keywords" content="VB, Visual, Basic, Simple, programmazione, codici, esempi, manuali, studio, sviluppo, ActiveX, OCX, articoli, notizie, apprendere, QBasic, API, COM, database">
</head>

<body bgcolor="#FFFFFF" leftmargin="0" topmargin="0">
<table width="100%" border="0" cellpadding="0" cellspacing="0" bgcolor="#FFFFFF">
  <tr>
    <td width="400" align="left" bgcolor="#FFFFFF"><img src="../images/vbslogo.jpg" width="400" height="80" border="0" alt="Visual Basic Simple"></td>
    <td width="100%" align="right" bgcolor="#FFFFFF"> 
      <div class="intestazioni"><a href="../home.htm">Home Page</a> <a href="../home.htm"><img src="../images/icons/dothome.gif" align="absmiddle" border="0" alt="Home Page" width="25" height="25"></a><br>
        <a href="../history.htm">Novit&agrave;</a> <a href="../history.htm"><img src="../images/icons/dotinfo.gif" align="absmiddle" border="0" alt="Informazioni su VB Simple" width="25" height="25"></a><br>
        <a href="../help.htm">Aiuto</a> <a href="../help.htm"><img src="../images/icons/dothelp.gif" align="absmiddle" border="0" alt="Hai bisogno d'aiuto?" width="25" height="25"></a></div>
    </td>
    <td width="160" align="center"><script type="text/javascript"><!--
google_ad_client = "pub-8218922773694577";
/* 160x90, creato 02/02/09 */
google_ad_slot = "8970907891";
google_ad_width = 160;
google_ad_height = 90;
//-->
</script>
<script type="text/javascript"
src="http://pagead2.googlesyndication.com/pagead/show_ads.js">
</script></td>
  </tr>
</table>

<div align="center"> 
  <div class="titolo"><!-- #BeginEditable "TITOLO" -->Open Source: i difetti diventano 
    pregi<!-- #EndEditable --></div>
  <script language="Javascript">NomePagina();</script>
  <table width="80%" border="1" cellspacing="1" cellpadding="3" bordercolorlight="#000000" bordercolordark="#000000" class="dontprint">
    <tr class="size0"> 
      <td align="center" width="25%"><a href="../ftv21/news.htm" target="treeframe"><img src="../images/icons/search%20window.gif" width="16" height="16" border="0" alt="Sincronizza Indice"><br>
        Sincronizza Indice</a></td>
      <td align="center" width="25%"><img src="../images/icons/tool%20download.gif" width="16" height="18" border="0" alt="Scarica il progetto"><br>
        Scarica il progetto</td>
      <td align="center" width="25%"><a href="javascript:ScaricaPDF();"><img src="../images/icons/tool%20pdf.gif" width="16" height="18" alt="Scarica il testo dell'articolo" border="0"><br>
        Testo dell'articolo</a></td>
      <td align="center" width="25%"><a href="javascript:Stampa();"><img src="../images/icons/tool%20print.gif" width="16" height="18" alt="Stampa l'articolo" border="0"><br>
        Stampa l'articolo</a></td>
    </tr>
  </table>
  </div>
<table width="100%" border="0">
  <tr> 
    <td width="80%"><script language="JavaScript">ShowArticlesScroller();</script><!-- #BeginEditable "CORPO" -->
      <p>Open Source non &egrave; solo la libera condivisione del codice sorgente 
        (licenza GPL o simili), &egrave; soprattutto una filosofia, dai risultati 
        entusiasmanti.</p>
      <p>Open Source &egrave; un modo di condividere le conoscenze, tutti mettono 
        le proprie capacit&agrave; e conoscenze a disposizione degli altri; se 
        il progetto &egrave; interessante, il numero molto alto delle persone 
        che programmano e debuggano consente di sviluppare progetti notevoli e 
        con crescita esplosiva.<br>
        Il progetto pu&ograve; essere spezzato e affidato a vari coordinatori, 
        cos&igrave; ci si pu&ograve; occupare solo delle parti che ci interessano 
        veramente.</p>
      <p align="center"><script type="text/javascript"><!--
google_ad_client = "pub-8218922773694577";
/* 468x60 solo grafica */
google_ad_slot = "0981518759";
google_ad_width = 468;
google_ad_height = 60;
//-->
</script>
<script type="text/javascript"
src="http://pagead2.googlesyndication.com/pagead/show_ads.js">
</script></p>
      <p>Si consiglia vivamente la lettura di <a href="http://www.agonet.it/mac/opensource/cattedrale.html" 
        target="_blank">http://www.agonet.it/mac/opensource/cattedrale.html</a> 
        e degli Halloween I-II-III (il tutto &egrave; disponibile in Italiano).<br>
        &Egrave; lo scritto in italiano di una persona, autore di un progetto 
        (fetchmail per Linux), e spiega, con fatti e teorie, perch&eacute; e come 
        l'Open Source funziona, ed &egrave;, anzi, nettamente superiore al modo 
        tradizionale di programmare.</p>
      <p>Vediamo un semplice esempio?<br>
        Una persona pu&ograve; costruire 2 case, di bellezza 7, di qualit&agrave; 
        7, di costo 8, in tot tempo.<br>
        Venti persone possono costruire 100 case, di bellezza 8, di qualit&agrave; 
        9, di costo 4, in tot tempo.<br>
        Questo perch&eacute; una persona da sola dovr&agrave; fare il giardiniere, 
        l'idraulico, l'arredatore, il muratore, ecc. e sar&agrave; efficace, e 
        soprattutto, gli piacer&agrave; fare solo una delle cose.<br>
        In 20 persone ci sar&agrave; sicuramente qualcuno che gli piace fare ed 
        e' efficace per ogni ruolo.<br>
        In parole semplici Open source &egrave; anche <i>&quot;ognuno faccia quello 
        che gli piace e che &egrave; capace di fare, perch&eacute; cos&igrave; 
        si diverte e rende molto molto di pi&ugrave;&quot;</i>.</p>
      <p>La filosofia Open Source fa' diventare degli enormi pregi quei difetti 
        che erano tali, solo per l'incapacit&agrave; di vedere oltre il proprio 
        naso: il rifiuto della concorrenza, tipico dei progetti Closed Source.</p>
      <p>Per iniziare, vi racconto di una mia esperienza involontaria e solitaria 
        di Open Source, premetto che le mie basi di programmatore sono very Closed 
        Source.<br>
        Ho iniziato scrivendo programmi in assembler per schede a microcontrollore 
        usando un commodore C-64, per poi trasferirli al buio (senza poter cio&egrave; 
        fare debug) sulla scheda dopo avere ricompilato il codice usando un assemblatore 
        autoprodotto scritto con QBasic (quante a$, b$, aa$ eheheh); pi&ugrave; 
        Closed di cos&igrave; si muore.</p>
      <p>Tempo fa ho iniziato un progetto (<b>FlexAgenda</b>) in Visual Basic, 
        in perfetto stile Closed Source (con obiettivo il codice), scrivendo codice 
        solo per me stesso, tenendone a mente tutta la struttura.<br>
        Risultato: qualit&agrave; prodotto 4, qualit&agrave; codice 5, robustezza 
        5, impegno richiesto 9, infatti passavo l'80% del tempo a gestire la struttura 
        del codice (che rottura!!!).</p>
      <p>Poi ho iniziato a non lavorarci per settimane, riprendere il lavoro per 
        qualche giorno, poi di nuovo pausa per settimane e via di seguito per 
        numerosi cicli.<br>
        Dopo ogni pausa mi ricordavo poco e niente del progetto, quindi sono stato 
        costretto ad imparare a scrivere codice utilizzabile da un altro che avesse 
        in mente poco e niente della struttura del codice (come me dopo le pause).</p>
      <p>Insomma i cicli di pause-modifiche (cicli <i>open sourcizzanti</i>) mi 
        hanno catapultato nell'Open Source, nello scrivere il codice per altri 
        (non c'&egrave; differenza nello scrivere per altri rispetto allo scrivere 
        per se stessi a distanza di tempo), avendo come obiettivo la struttura 
        dei dati.<br>
        Mi &egrave; diventato normale chiedermi continuamente &quot;<i>come posso 
        scrivere il codice in maniera che sia semplice rileggerlo</i>&quot;?</p>
      <p>Risultato dei cicli <i>open</i>: qualit&agrave; prodotto 7, qualit&agrave; 
        codice 7, robustezza 8 (un solo grosso bug in mesi di utilizzo e per giunta 
        previsto, nonostante che la gestione degli errori fosse a dir poco grezza), 
        impegno richiesto 7 (a tratti mi sono persino divertito!!).</p>
      <p>Dopo questa esperienza sono giunto a queste conclusioni:<br>
        &Egrave; falso che sia pi&ugrave; rapido riscrivere che usare codice altrui, 
        chiunque percorra un buon numero di cicli <i>open sourcizzanti</i> impara 
        a scrivere codice (ri)leggibile.<br>
        Problema: &egrave; illeggibile?<br>
        Soluzione: riscrittura del programma con obiettivo i dati (gli altri) 
        e non il codice (me stesso).</p>
      <p>&Egrave; falso che la leggibilit&agrave; sia data dallo stile di scrittura.<br>
        &Egrave; invece determinata dal porsi in ogni momento l'obiettivo e averne 
        la necessit&agrave; - cosa che non succede nei lavori Closed Source poich&eacute; 
        i cicli open sourcizzanti sono troppo radi e quasi sempre ostacolati ed 
        il progetto muore prima.<br>
        &Egrave; falso che chi impara la programmazione in Visual Basic scrive 
        codice peggiore di chi impara in C++, il programmatore VB, immerso nei 
        cicli open sourcizzanti, produce codice di categoria nettamente superiore 
        a un programmatore C++ Closed Source.</p>
    <p align="center"><script type="text/javascript"><!--
google_ad_client = "pub-8218922773694577";
/* Contenuti 468x60 */
google_ad_slot = "0785185013";
google_ad_width = 468;
google_ad_height = 60;
//-->
</script>
<script type="text/javascript"
src="http://pagead2.googlesyndication.com/pagead/show_ads.js">
</script></p>
      <p>Qualsiasi progetto (o modifica) nasce in modalit&agrave; Closed Source, 
        ma pu&ograve; essere gestito con successo solo in modalit&agrave; Open 
        Source (in Closed Source il progetto diventa rapidamente ingestibile e 
        palloso).</p>
      <p>L'Open Source &egrave; basato su <b>Minima Massa Critica</b> (MMC), <b>Basso 
        Tempo di Risposta</b> (BTP), <b>Anarchia Costruttiva</b> (AC).<br>
        Quando queste cose funzionano insieme, il risultato &egrave; un'esplosione, 
        di progetti, di codice, di alta quantit&agrave; e qualit&agrave;, che, 
        una volta innescata continua a crescere fino al massimo consentito dallo 
        spazio disponibile, dalla rapidit&agrave; di comunicazione.<br>
        La sostituzione delle persone che escono dai progetti &egrave; rapidissima 
        (come si dice, c'&egrave; la fila).</p>
      <hr>
      <p align="center" class="size3">MINIMA MASSA CRITICA<br>
        Un progetto diventa vivo</p>
      <p>&Egrave; il primo pilastro dell'Open Source, ed &egrave; anche il nucleo 
        di alcuni newsgroup, in primis <a href="news:it.comp.lang.visual-basic">it.comp.lang.visual-basic</a>.</p>
      <p>Vediamo di spiegazzarci :)<br>
        Se avete frequentato quel NG, avreste notato che molti hanno fatto i complimenti 
        trovandolo pieno di gente esperta, in gamba, disponibili, conoscitori 
        di vari linguaggi; insomma un grande NG. Sapete perch&eacute; e' cos&igrave;? 
        Ci sono vari motivi.</p>
      <p>C'&egrave; innanzitutto la spinta a primeggiare, lo spirito di gruppo, 
        l'emulazione, e altre cosette simili. Questo fa s&igrave; che se c'&egrave; 
        uno che risponde a decine di post, ecco che anch'io sono spinto a rispondere 
        a pi&ugrave; persone, se c'&egrave; uno che risponde con precisione e 
        bravura, ecco che anch'io sono spinto a dare risposte migliori, se c'&egrave; 
        uno che risponde anche agli inesperti, ecco che anch'io sono spinto a 
        rispondere agli inesperti, ecc.<br>
        Quelli dell'Open Source di Linux lo chiamano <i>egocentrismo generoso</i> 
        ma io preferisco definirlo aperto, cosciente, intelligente.</p>
      <p>Ecco cos'&egrave; la <i>Minima Massa Critica</i>. Quando viene raggiunta 
        succede che io spingo te, tu spingi un altro, un altro spinge un altro 
        ancora ..... e qualcun altro spinge me.<br>
        I risultati della reazione sono molto molto positivi per tutti ed una 
        volta innescata, va' avanti da sola: anche se uno sparisce, viene rimpiazzato 
        poich&eacute; nuove persone non vedono l'ora di partecipare.</p>
      <p>Ma perch&eacute; si inneschi questo &egrave; necessario un numero minimo 
        di persone, che varia in base all'interesse che ha il progetto e alla 
        velocit&agrave; della comunicazione, altrimenti la reazione si spegne.</p>
      <hr>
      <p align="center" class="size3">BASSO TEMPO DI PUBBLICAZIONE<br>
        La rapidit&agrave; non &egrave; andare al limite</p>
      <p>Come si ottiene un alta velocit&agrave; di comunicazione?<br>
        &Egrave; necessario lavorare almeno 23 ore al giorno?</p>
      <p>Forse vi sto confondendo le idee, quindi parler&ograve; ancora di un 
        caso reale: del NG.<br>
        Molte persone hanno elogiato l'incredibile velocit&agrave; di risposta 
        e qualit&agrave;, tale che, se dovesse fare concorrenza a un servizio 
        di help di una ditta commerciale, il suddetto help verrebbe formattato 
        dalla faccia della terra.</p>
      <p>Come funziona la cosa?<br>
        Ci sono vari motivi.</p>
      <p>Se io adesso ho cinque minuti liberi, mi sento spinto a rispondere ai 
        vari post, perch&eacute; s&ograve; che la mia risposta arriver&agrave; 
        in tempo utile (<i>Basso Tempo di Pubblicazione</i>).<br>
        Se il tempo di pubblicazione fosse alto chi me lo farebbe fare?<br>
        Tanto avr&agrave; gi&agrave; risposto qualcun altro. Tanto si sar&agrave; 
        gi&agrave; arrangiato da solo?</p>
      <p>Beh se si ha un alto numero di persone, per un semplice motivo statistico, 
        nell'arco di 24h ci sar&agrave; sempre qualcuno che ha cinque minuti liberi 
        e che si sente stimolato a rispondere.<br>
        Con tante persone, e con un basso tempo di pubblicazione si ottiene: basso 
        sforzo del singolo, grande qualit&agrave; globale, basso tempo di risposta 
        globale o, meglio ancora, <b><i>il massimo con il minimo sforzo</i></b>.</p>
      <hr>
      <p align="center" class="size3">ANARCHIA COSTRUTTIVA<br>
        Gestire &egrave; un male, soffoca e incasina</p>
      <p>Un vantaggio notevole dell'anarchia &egrave; che gli impegni (coordinamento, 
        distribuzione, pubblicazione, ecc.) vengono suddivisi tra pi&ugrave; persone. 
        Alta velocit&agrave; e basso sforzo.</p>
      <p>Esempio di Open Source:<br>
        C'&egrave; un sito che funziona da raccoglitore e da coordinatore e rende 
        disponibili i mezzi e gli strumenti necessari per rendere facile il lavoro 
        in comune (strumenti di conversione per VB 3-4-5-6-100.000, strumenti 
        per evidenziare le modifiche e aggiornare automaticamente i progetti, 
        ecc.).<br>
        Chiunque pu&ograve; caricare e scaricare liberamente qualunque codice 
        sorgente, progetti Open Source, sotto licenza GPL o simili.<br>
        Chiunque pu&ograve; registrarsi come gestore di un progetto Open Source, 
        e solo il gestore potr&agrave;, liberamente, modificare il codice e il 
        progetto Open Source (chiunque potr&agrave; comunque scaricare liberamente 
        il progetto, il codice).</p>
      <p align="center"><script type="text/javascript"><!--
google_ad_client = "pub-8218922773694577";
/* 468x60 solo testo */
google_ad_slot = "6726967947";
google_ad_width = 468;
google_ad_height = 60;
//-->
</script>
<script type="text/javascript"
src="http://pagead2.googlesyndication.com/pagead/show_ads.js">
</script></p>
      <p><i>Io, Dbg, carico e registro il progetto <b>FlexAgenda</b> (ehehehe).</i><br>
        Altri trovano interessante la cosa e decidono di partecipare; essendo 
        in tanti, il progetto viene diviso in sotto problemi e i sottoprogetti 
        vengono caricati nel sito e registrati da altre persone.</p>
      <p><i>Borrelli nota che da un po' di tempo Dbg non segue il progetto, lo 
        gestisce male, fa' casino, e visto che Dbg fa finta di niente, decide 
        di gestire lui il progetto.</i><br>
        Scarica il progetto <b>FlexAgenda</b>, lo modifica, lo carica nel sito 
        Open Source come <i><b>Borrelli_FlexAgenda</b></i> e si registra come 
        gestore.<br>
        Tutti i partecipanti insoddisfatti del progetto <b>FlexAgenda</b> passano 
        al nuovo progetto.</p>
      <p><i>Fibia guarda tutti due i progetti, nota che sono complicati, astrusi, 
        indigeribili, e decide di gestire un nuovo progetto, FlexAgenda per tutti 
        (ehehehe)</i>.<br>
        Scarica il progetto FlexAgenda, lo modifica, lo carica nel sito Open Source 
        come <b>Simple_FlexAgenda</b> e si registra come gestore.</p>
      <p>In maniera facile, indolore, rapida, si creano progetti in grado di interessare 
        i vari tipi di interessi, attitudini, capacit&agrave;, delle persone.<br>
        Alla fine il progetto migliore e forse vincente, sar&agrave; quello che 
        avr&agrave; suscitato pi&ugrave; interesse e non quello che un <i>dittatore</i> 
        avrebbe deciso come valido.</p>
      <p>I progetti <b>Borrelli_FlexAgenda</b>, <b>Simple_FlexAgenda</b> stanno 
        crescendo, e il progetto <b>FlexAgenda</b> &egrave; un po' fermo a causa 
        della notoria incostanza del suo gestore, ma ecco che in due mesi infuocati, 
        prendendo spunto dai due progetti, il progetto viene rianimato dal suo 
        gestore e dai partecipanti, accresciuto, recupera e sorpassa i progetti.<br>
        Intelligentemente i gestori e i partecipanti degli altri due progetti 
        guardano al progetto <b>FlexAgenda</b> e recuperano il terreno perso.</p>
      <p>Ognuno fa quello che gli piace fare, dove gli piace fare, con chi gli 
        piace fare, quando gli piace farlo e il risultato di questo sono sempre 
        ottimi risultati.<br>
        E questi ottimi risultati sono disponibili a tutti, niente va' mai perso, 
        tutto diventa almeno una base di partenza per qualcun altro.</p>
      <p>Questo scritto &egrave; composto da mie e altrui esperienze e idee.<br>
        Chiunque voglia puntualizzare, criticare, suggerire, sostenere, o comunicare 
        mi contatti su bepi@adria.it o bepii@libero.it.</p>
      <!-- #EndEditable --></td>
  </tr>
</table>

<table width="100%">
  <tr> 
    <td><!-- #BeginEditable "FINALE" --><!-- #EndEditable -->
      <!-- #BeginEditable "CREDITS" --> 
      <p align="right" class="credits2"><a href="../vbmail.htm?id=3">Giuseppe 
        Della Bianca</a><br>
        11 Dicembre 2000</p>
      <!-- #EndEditable --><!-- #BeginLibraryItem "/Library/Toolbar2.lbi" -->
      <table width="80%" border="1" cellspacing="1" cellpadding="3" align="center" bordercolor="#000000" class="dontprint">
        <tr> 
          <td align="center" valign="top" width="33%"><img src="../images/icons/tool%20download.gif" width="16" height="18" border="0" alt="Scarica il progetto"><br>
            <span class="size1">Scarica il progetto</span></td>
          <td align="center" valign="top" width="33%"><a href="javascript:ScaricaPDF();"><img src="../images/icons/tool%20pdf.gif" width="16" height="18" alt="Scarica il testo dell'articolo" border="0"><br>
            <span class="size1">Scarica il testo dell'articolo</span></a></td>
          <td align="center" valign="top" width="33%"><a href="javascript:Stampa();"><img src="../images/icons/tool%20print.gif" width="16" height="18" alt="Stampa l'articolo" border="0"><br>
            <span class="size1">Stampa l'articolo</span></a></td>
        </tr>
      </table><!-- #EndLibraryItem -->
    </td>
  </tr>
</table>
<table width="100%" border="0" cellspacing="2" cellpadding="2">
  <tr>
    <td align="left"><a href="index.htm"><img src="../images/vbprev.jpg" width="49" height="32" align="absmiddle" border="0"> 
      Torna all'indice degli articoli</a></td>
    <td align="right">&nbsp;</td>
  </tr>
</table>

<hr width="80%">
<table width="100%">
  <tr>
    <td width="100%" align="center">
      <script language="Javascript">Banner();</script>
      <!--#echo banner=""-->
    </td>
  </tr>
</table>
<script language="Javascript">FibiaWebStats();</script>
</body>
<!-- #EndTemplate --></html>
